[
	{
		"title": "Mile Tracker",
		"dateFinished": "2017-03-01",
		"url": "https://ee-mile-tracker.herokuapp.com/",
		"description": "Built to help companies track their travel mileage and associated carbon dioxide emissions. Utilized by employees at Equal Exchange, a multi-million dollar fair-trade coffee company, who have tracked over 400,000 miles and 200,000 pounds of carbon dioxide emissions.",
		"sourceCode": "https://github.com/aaronbini/mile-tracker-server",
		"category": "Angular 1.5 component framework on the front-end. Node.js (Express) server backed by MongoDB database."
	},
	{
		"title": "Quake Tracker",
		"dateFinished": "2016-12-15",
		"description": "Map-based web app for viewing all earthquakes that have occurred in the last 30 days in the Pacific NW, and around the world. Pulls in data from the USGS Earthquake API. Hover over earthquakes on the map to view detailed information about each quake. Ongoing work includes aggregating earthquake data and presenting in a sidebar, and allowing users to query for more specific information they are interested in.",
		"sourceCode": "https://github.com/aaronbini/Quake-Tracker",
		"category": "Angular 1.5 component framework on the front-end."
	},
	{
		"title": "BP Tracker",
		"dateFinished": "2016-12-10",
		"url": "https://github.com/aaronbini/BP-Tracker",
		"description": "A single page app for tracking daily blood pressure readings. Uses Google OAuth and is synced with the Google Fit API. Users can set goals for BP readings (systolic/diastolic), #readings/week, hours of sleep/night, etc. and view their BP readings history via charts and graphs. First link above is to the client-side code, second link is to the server-side code.",
		"sourceCode": "https://github.com/aaronbini/BP-Server",
		"category": "Angular front-end backed by Node.js (Express) REST API and MongoDB."
	},
	{
		"title": "Clever Job Hunter",
		"dateFinished": "2016-09-16",
		"url": "http://insertclevernamehere.herokuapp.com/#/",
		"description": "A single page app that helps job-seekers keep track of their job search. I developed the back-end user routing and statistics tracking. On the front-end I contributed significantly on the Angular component architecture.",
		"sourceCode": "https://github.com/InsertCleverNameHere",
		"category": "Angular on the front-end along with Angular UI-Router for client-side routing, and Node.js (Express framework) REST services backed by MongoDB on the back-end."
	},
	{
		"title": "U.S. Housing Affordability Tool",
		"dateFinished": "2016-07-01",
		"url": "http://atlas-housing-2.herokuapp.com/",
		"description": "A single page app that helps prospective home-buyers figure out where they can afford to buy homes. I developed user interaction with the map and set up calls to pull data from U.S. Census and Zillow API's.",
		"sourceCode": "https://github.com/lizziegooding/Housing-Affordability",
		"category": "HTML5, CSS3, JavaScript, JQuery, PageJS, Express."
	}
]
